MichalRogat/ROBOT_ROTEM_SELA/robot_rogat/stm32f401_adc_handling/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define Motor_1_current_Pin GPIO_PIN_1
#define Motor_1_current_GPIO_Port GPIOA
#define Motor_2_current_Pin GPIO_PIN_2
#define Motor_2_current_GPIO_Port GPIOA
#define Elevation_Motor_1_Pin GPIO_PIN_3
#define Elevation_Motor_1_GPIO_Port GPIOA
#define Turn_Motor_1_Pin GPIO_PIN_4
#define Turn_Motor_1_GPIO_Port GPIOA
#define Turn_Motor_2_Pin GPIO_PIN_5
#define Turn_Motor_2_GPIO_Port GPIOA
#define Joint_Motor_1_Pin GPIO_PIN_6
#define Joint_Motor_1_GPIO_Port GPIOA
#define FullTank_1_Pin GPIO_PIN_7
#define FullTank_1_GPIO_Port GPIOA
#define FullTank_2_Pin GPIO_PIN_0
#define FullTank_2_GPIO_Port GPIOB
#define FullTank_3_Pin GPIO_PIN_1
#define FullTank_3_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
